БылковД.А_70180166/src/Documents/ИндивидуальныйПланЛиквидацииЗадолженностей/ИндивидуальныйПланЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИндивидуальныйПланЛиквидацииЗадолженностей</name>
  <basedOn>Document.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</basedOn>
  <registerRecords>InformationRegister.ДатыПересдач</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>DocumentRef.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</types>
    </type>
  </attributes>
</mdclass:Document>

БылковД.А_70180166/src/InformationRegisters/ДатыПересдач/ДатыПересдач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыПересдач</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяПересдачи</name>
    <type>
      <types>EnumRef.Время</types>
    </type>
  </resources>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БылковД.А_70180166/src/Documents/ИндивидуальныйПланЛиквидацииЗадолженностей/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности") Тогда
		// Заполнение шапки
		Группа = ДанныеЗаполнения.Группа;
		Дисциплина = ДанныеЗаполнения.Дисциплина;
		ДатаПересдачи = ДанныеЗаполнения.ЗапрашиваемыйСрок;
		НаименованиеКонтроля = ДанныеЗаполнения.НаименованиеКонтроля;
		Причина = ДанныеЗаполнения.Ссылка;
		Студент = ДанныеЗаполнения.Студент;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ДатыПересдач
	Движения.ДатыПересдач.Записывать = Истина;
	Движение = Движения.ДатыПересдач.Добавить();
	Движение.Преподаватель = Преподаватель;
	Движение.Аудитория = Аудитория;
	Движение.Дисциплина = Дисциплина;
	Движение.ДатаВыдачи = ДатаПересдачи;
	Движение.ДатаПересдачи = ДатаПересдачи;
	Движение.ВремяПересдачи = Время;

КонецПроцедуры
